----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
           Dropout-1          [-1, 3, 128, 128]               0
            Conv2d-2         [-1, 64, 128, 128]           1,792
              ReLU-3         [-1, 64, 128, 128]               0
       BatchNorm2d-4         [-1, 64, 128, 128]             128
         MaxPool2d-5           [-1, 64, 64, 64]               0
           Dropout-6           [-1, 64, 64, 64]               0
            Conv2d-7           [-1, 64, 64, 64]          36,928
              ReLU-8           [-1, 64, 64, 64]               0
       BatchNorm2d-9           [-1, 64, 64, 64]             128
        MaxPool2d-10           [-1, 64, 32, 32]               0
          Dropout-11           [-1, 64, 32, 32]               0
           Conv2d-12          [-1, 128, 32, 32]          73,856
             ReLU-13          [-1, 128, 32, 32]               0
      BatchNorm2d-14          [-1, 128, 32, 32]             256
        MaxPool2d-15          [-1, 128, 16, 16]               0
          Dropout-16          [-1, 128, 16, 16]               0
           Conv2d-17          [-1, 256, 16, 16]         295,168
             ReLU-18          [-1, 256, 16, 16]               0
      BatchNorm2d-19          [-1, 256, 16, 16]             512
        MaxPool2d-20            [-1, 256, 8, 8]               0
          Dropout-21            [-1, 256, 8, 8]               0
           Conv2d-22            [-1, 512, 8, 8]       1,180,160
             ReLU-23            [-1, 512, 8, 8]               0
      BatchNorm2d-24            [-1, 512, 8, 8]           1,024
        MaxPool2d-25            [-1, 512, 4, 4]               0
          Dropout-26            [-1, 512, 4, 4]               0
           Conv2d-27             [-1, 64, 4, 4]         294,976
             ReLU-28             [-1, 64, 4, 4]               0
      BatchNorm2d-29             [-1, 64, 4, 4]             128
        MaxPool2d-30             [-1, 64, 2, 2]               0
          Flatten-31                  [-1, 256]               0
           Linear-32                  [-1, 256]          65,792
          Dropout-33                  [-1, 256]               0
             ReLU-34                  [-1, 256]               0
           Linear-35                    [-1, 2]             514
================================================================
Total params: 1,951,362
Trainable params: 1,951,362
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.19
Forward/backward pass size (MB): 41.53
Params size (MB): 7.44
Estimated Total Size (MB): 49.16
----------------------------------------------------------------
